tutorials/waterJet2/0.orig/alpha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-5;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    waterInlet
    {
        //type            fixedValue;
        //value           uniform 0.8;
        type            slip;
    }

    bottomLeft
    {
        type            slip;
    }

    bottomRight
    {
        type            slip;
    }

    top
    {
        type            zeroGradient;
    }
    
    emptyPlanes1
    {
        type            empty;
    }

    emptyPlanes2
    {
        type            empty;
    }
}

// ************************************************************************* //
