tutorials/waterJet2/0.orig/k.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 10;
internalField   uniform 0.576;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.001;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-05;
        value           $internalField;
    }

    waterInlet
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }

    bottomLeft
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }

    bottomRight
    {
        type            kLowReWallFunction;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    emptyPlanes1
    {
        type            empty;
    }

    emptyPlanes2
    {
        type            empty;
    }
}


// ************************************************************************* //
