tutorials/waterJet2/0.orig/nut.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    waterInlet
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    bottomLeft
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    bottomRight
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    emptyPlanes1
    {
        type            empty;
    }

    emptyPlanes2
    {
        type            empty;
    }
}


// ************************************************************************* //
