tutorials/waterJet2/system/blockMeshDictOld
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                        |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************* //

convertToMeters 1.0;

vertices
(
    // z = 0
    (0.000  0.000  0.000)   // 0
    (0.080  0.000  0.000)   // 1
    (0.082  0.000  0.000)   // 2
    (0.200  0.000  0.000)   // 3

    (0.000  0.180  0.000)   // 4
    (0.080  0.180  0.000)   // 5
    (0.082  0.180  0.000)   // 6
    (0.200  0.180  0.000)   // 7

    // z = 0.001
    (0.000  0.000  0.001)   // 8
    (0.080  0.000  0.001)   // 9
    (0.082  0.000  0.001)   // 10
    (0.200  0.000  0.001)   // 11

    (0.000  0.180  0.001)   // 12
    (0.080  0.180  0.001)   // 13
    (0.082  0.180  0.001)   // 14
    (0.200  0.180  0.001)   // 15
);

blocks
(
    // Left block: 0.08 m wide
    hex (0 1 5 4 8 9 13 12)
    (100 120 1)
    simpleGrading (1 1 1)

    // Middle block: 0.002 m wide
    hex (1 2 6 5 9 10 14 13)
    (3 120 1)
    simpleGrading (1 1 1)

    // Right block: 0.118 m wide
    hex (2 3 7 6 10 11 15 14)
    (147 120 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 12 8)
        );
    }

    bottomLeft
    {
        type wall;
        faces
        (
            (0 8 9 1)
        );
    }

    waterInlet
    {
        type wall;
        faces
        (
            (1 9 10 2)
        );
    }

    bottomRight
    {
        type wall;
        faces
        (
            (2 10 11 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 11 15 7)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
        );
    }

    emptyPlanes1
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }

    emptyPlanes2
    {
        type empty;
        faces
        (
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }
);

// ************************************************************************* //
