tutorials/waterJet2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

riemannSolver       mslau2;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limitedGauss    cellLimited Gauss linear 1;
    //venkatakrishnan cellLimited<cubic> 1.5 leastSquares 1;
    venkatakrishnan cellLimited<cubic> 1.5 leastSquares 1;
    grad(U) Gauss linear;
    grad(h) Gauss linear;
}

divSchemes
{
    default         none;
    div(interpolate(U.1),U.1)   Gauss linear;
    div(interpolate(U.2),U.2)   Gauss linear;
    div(alphaRhoPhiL.1,k.1)      Gauss linearUpwind limitedGauss;
    div(alphaRhoPhiL.1,omega.1)  Gauss linearUpwind limitedGauss;
    div(devRhoReff.1) Gauss linear;
    div((devRhoReff.1&U.1)) Gauss linear;

    div((muEff*dev2(grad(U.1).T()))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default        linear;
    //reconstruct(p)      upwind;
    //reconstruct(alpha)  upwind;
    //reconstruct(U.1)    upwind;
    //reconstruct(U.2)    upwind;
    //reconstruct(T.1)    upwind;
    //reconstruct(T.2)    upwind;

    reconstruct(p)      linearUpwind  venkatakrishnan;
    reconstruct(alpha)  linearUpwind  venkatakrishnan;
    reconstruct(U.1)    linearUpwindV venkatakrishnan;
    reconstruct(U.2)    linearUpwindV venkatakrishnan;
    reconstruct(T.1)    linearUpwind  venkatakrishnan;
    reconstruct(T.2)    linearUpwind  venkatakrishnan;
}

snGradSchemes
{
    //default         corrected;
    default         limited corrected 0.5;
}

fluxRequired
{
    default         no;
}

wallDist {
    method meshWave;
}



// ************************************************************************* //
