tutorials/waterJet2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alphaRho1
    {
        solver diag;
    }

    alphaRho2
    {
        solver diag;
    }

    alphaRhoU1 
    {
        solver diag;
    }

    alphaRhoU2
    {
        solver diag;
    }

    epsilon1 
    {
        solver diag;
    }

    epsilon2
    {
        solver diag;
    }  

    "(k.1|omega.1)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        //solver          BiCCG;
        //preconditioner  DILU;
        //tolerance       1e-8;
        //relTol          0;
        minIter 1;
    }
}

relaxationFactors
{
    equations
    {
        "(k.1|epsilon.1|omega.1)"   0.7;
        yWall           0.7;
    }
}



LUSGS {
    iterations 1;
    internalIterations 1;
    localTimestepping false;
    relaxCoeff 1;
    omega 1.5;
}


// ************************************************************************* //
